Autodesk.Revit.DB.Geolocation.Services.ILoadGeolocationServerProxy.LoadGeolocation(Autodesk.Revit.DB.Geolocation.Services.LoadGeolocationData)
Create and fill in a GeolocationBase based on the specified Json.

Autodesk.Revit.DB.Geolocation.Services.ILoadGeolocationServerProxy.LoadDerivedGeolocation(Autodesk.Revit.DB.Geolocation.Services.LoadGeolocationData)
Create and fill in a DerivedGeolocation based on the collection of JSONData.